\запуск
\(АПЕРО.стиль="ночной минимализм")
\(АПЕРО.блок.скругление="нет")
\(АПЕРО.блок.отступ.общий=8)
\(АПЕРО.сохранение.скрыть=1)
\(АПЕРО.кнопка.без подчеркивания=1)
\(АПЕРО.блок.шрифт="Courier")
\(фон0далее="#00008B")
\(рк=1)//значение переменной радиокнопки
\(режим=2)
\СТОП(стр10)

\стр10
игра ТЕТРИС 4-х битный
game TETRIS 4 bit
\(стр20, (таблица)(строка \(фон0далее))(столбец)далее(/столбец)(/строка)(/таблица))// МАКЕТ КРУТОЙ КНОПКИ С СЕНСОРОМ ПО ВСЕЙ ШИРИНЕ
\СТОП

\стр20//ПЕРВОЕ ЗАПОЛНЕНИЕ СТАКАНА ТОЧКАМИ
\(y=1)
\стр2005
\ЕСЛИ (y>5) \ТО \СТОП(стр201)
\(x=1)\(z=0)
\ЦИКЛ (x<6) \СДЕЛАТЬ\(z=y*5)\(z=z-5)\(z=z+x)\(массив(z)=".")\(x=x+1)
\(y=y+1)
[br]
\СТОП(стр2005)
\стр201
\СТОП(стр30)


\стр30//ПРОВЕРКА ПРОИГРЫША И СПАВН НОВОЙ РАНДОМНОЙ ФИГУРЫ
\ЕСЛИ (массив(6)<>".")  \ТО\СТОП(стр50)
\ЕСЛИ (массив(7)<>".")  \ТО\СТОП(стр50)
\ЕСЛИ (массив(8)<>".")  \ТО\СТОП(стр50)
\ЕСЛИ (массив(9)<>".")  \ТО\СТОП(стр50)
\ЕСЛИ (массив(10)<>".")  \ТО\СТОП(стр50)
\(qqa=АПЕРО.случайно(3))
\(qqb=АПЕРО.случайно(5))
\ЕСЛИ (qqa=1) \ТО\(фигура=1)\(массив(qqb)="3")\СТОП(стр301)
\ЕСЛИ (qqa=2) \ТО\(фигура=2)\(массив(qqb)="C")\СТОП(стр301)
\ЕСЛИ (qqa=3) \ТО\(фигура=3)\(массив(qqb)="F")\СТОП(стр301)
\стр301
\(xx=qqb)
\(yy=1)
\(фаза=1)
\СТОП(стр40)

\стр40
\СТОП(стр40а)

\стр4005
\ЕСЛИ (y>5) \ТО \СТОП(стр401)
\(x=1)\(z=0)
\ЦИКЛ (x<6) \СДЕЛАТЬ\(z=y*5)\(z=z-5)\(z=z+x)\(массив(z))\(x=x+1)
\(y=y+1)
[br]
\СТОП(стр4005)
\стр401
\(отклик)
[table=1][tr][td]
\ПЕРЕКЛЮЧАТЕЛЬ(рк, 1, "сброс", 0)
\ПЕРЕКЛЮЧАТЕЛЬ(рк, 2, "поворот", 0)
\ПЕРЕКЛЮЧАТЕЛЬ(рк, 3, "сдвиг", 0)
[/td][/tr][/table]
\(стр60, (таблица)(строка \(фон0далее))(столбец)далее(/столбец)(/строка)(/таблица))// МАКЕТ КРУТОЙ КНОПКИ С СЕНСОРОМ ПО ВСЕЙ ШИРИНЕ
\СТОП

\стр40а
[tab=1](строка)(столбец)
\(y=1)
\стр4005аа
\ЕСЛИ (y>5) \ТО \СТОП(стр401аа)
\(x=1)\(z=0)
\ЦИКЛ (x<6) \СДЕЛАТЬ\(z=y*5)\(z=z-5)\(z=z+x)\(массив(z))\(x=x+1)
\(y=y+1)
[br]
\СТОП(стр4005аа)
\стр401аа
(/столбец)(столбец)
\(стр_поворот1,поворот)
\(стр_вправо1,смещение)
\(стр_сброс1,сброс)
(/столбец)(/строка)[/tab]
\СТОП

\стр50
ВЫ ПРОИГРАЛИ
\(запуск, (таблица)(строка \(фон0далее))(столбец)далее(/столбец)(/строка)(/таблица))// МАКЕТ КРУТОЙ КНОПКИ С СЕНСОРОМ ПО ВСЕЙ ШИРИНЕ
\СТОП

\стр60
\ЕСЛИ (рк=1) \ТО \СТОП(стр_сброс1)
\ЕСЛИ (рк=2) \ТО \СТОП(стр_поворот1)
\ЕСЛИ (рк=3) \ТО \СТОП(стр_вправо1)
\ЕСЛИ (рк=4) \ТО \СТОП(стр_влево1)
\СТОП

\стр_вправо1
\(ww=xx+1)
\ЕСЛИ (ww>5) \ТО\СТОП(стр_вправо2)
\(zz=массив(xx))
\(массив(xx)=".")
\(xx=xx+1)
\(массив(xx)=zz)
\СТОП(стр40)

\стр_вправо2
\(zz=массив(xx))
\(массив(xx)=".")
\(xx=1)
\(массив(xx)=zz)
\СТОП(стр40)

\стр_поворот1
//АНАЛИЗ ФИГУРЫ И ВЫБОР ПРОГРАММЫ ПОВОРОТА
\ЕСЛИ (фигура=1) \ТО\СТОП(фигура_1)//11,00;10,10//3,A
\ЕСЛИ (фигура=2) \ТО\СТОП(фигура_2)//00,11;01,01//C,5
\ЕСЛИ (фигура=3) \ТО\СТОП(стр40)//00,11;01,01//C,5
\СТОП

\стр_сброс1
\(wwwc=yy*5)
\(wwwc=wwwc-5)
\(wwwc=wwwc+xx)
\(wwwz=массив(wwwc))
\(wwy=yy+1)
\ЕСЛИ (wwy>5) \ТО\(отклик="фигура упала на поверхность")\СТОП(стр_сброс12)
\(ww=wwwc+5)
\(wwm=массив(ww))
\ЕСЛИ (массив(ww)<>".") \ТО\СТОП(стр_900)
\стр_сброс11
\(yy=yy+1)
\(массив(wwwc)=".")
\(массив(ww)=wwwz)
\СТОП(стр_сброс1)

\стр_сброс12
\ЕСЛИ (массив(wwwc)="3") \ТО\(массив(wwwc)="C")\(отклик="0011 осыпались вниз и стали 1100 (hex=C)")\СТОП(стр30)
\СТОП(стр30)

\фигура_1
\ЕСЛИ (фаза=1) \ТО\(массив(xx)="A")\(фаза=2)\СТОП(стр40)
\ЕСЛИ (фаза=2) \ТО\(массив(xx)="3")\(фаза=1)\СТОП(стр40)
\СТОП(стр40)

\фигура_2
\ЕСЛИ (фаза=1) \ТО\(массив(xx)="5")\(фаза=2)\СТОП(стр40)
\ЕСЛИ (фаза=2) \ТО\(массив(xx)="C")\(фаза=1)\СТОП(стр40)
\СТОП(стр40)

\фигура_3
\СТОП(стр40)

\стр_900
\ЕСЛИ (wwwz="3") \ТО\СТОП(стр_910)
\ЕСЛИ (wwwz="A") \ТО\СТОП(стр_920)
\ЕСЛИ (wwwz="5") \ТО\СТОП(стр_930)
\ЕСЛИ (wwwz="C") \ТО\СТОП(стр_940)
\СТОП(стр30)

\стр_910
\ЕСЛИ (wwm="C") \ТО\(массив(ww)="F")\(массив(wwwc)=".")\СТОП(стр30)
\ЕСЛИ (wwm="F") \ТО\(массив(wwwc)="C"\СТОП(стр30)
\СТОП(стр30)

\стр_920
\ЕСЛИ (wwm="5") \ТО\(массив(ww)="F")\(массив(wwwc)=".")\СТОП(стр30)
\ЕСЛИ (wwm="F") \ТО\СТОП(стр30)
\СТОП(стр30)

\стр_930
\ЕСЛИ (wwm="A") \ТО\(массив(ww)="F")\(массив(wwwc)=".")\СТОП(стр30)
\ЕСЛИ (wwm="F") \ТО\СТОП(стр30)
\СТОП(стр30)

\стр_940
\ЕСЛИ (wwm="C") \ТО\(массив(ww)="F")\(массив(wwwc)=".")\СТОП(стр30)
\ЕСЛИ (wwm="F") \ТО\СТОП(стр30)
\СТОП(стр30)
